#### `terraform plan` Success for `deployments/`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.service_roles.aws_iam_role.orbis_roles[0] must be replaced
-/+ resource "aws_iam_role" "orbis_roles" {
      ~ arn                   = "arn:aws:iam::595072229124:role/orbis/dude" -> (known after apply)
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = [
                          - "sts:AssumeRoleWithWebIdentity",
                          - "sts:AssumeRole",
                        ] -> "sts:AssumeRoleWithWebIdentity"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::595072229124:role/elzwhere"
                        }
                        Sid       = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2020-05-19T23:52:33Z" -> (known after apply)
        force_detach_policies = false
      ~ id                    = "dude" -> (known after apply)
        max_session_duration  = 3600
      ~ name                  = "dude" -> "ogm" # forces replacement
        path                  = "/orbis/"
        tags                  = {
            "Customer"    = "dtc"
            "Environment" = "dev"
            "Team"        = "dtc"
        }
      ~ unique_id             = "AROAYVDIRT4CEDGA56BYC" -> (known after apply)
    }

  # module.service_roles.aws_iam_role.orbis_roles[1] must be replaced
-/+ resource "aws_iam_role" "orbis_roles" {
      ~ arn                   = "arn:aws:iam::595072229124:role/orbis/this" -> (known after apply)
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = [
                          - "sts:AssumeRoleWithWebIdentity",
                          - "sts:AssumeRole",
                        ] -> "sts:AssumeRoleWithWebIdentity"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::595072229124:role/elzwhere"
                        }
                        Sid       = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2020-05-19T23:52:33Z" -> (known after apply)
        force_detach_policies = false
      ~ id                    = "this" -> (known after apply)
        max_session_duration  = 3600
      ~ name                  = "this" -> "obm" # forces replacement
        path                  = "/orbis/"
        tags                  = {
            "Customer"    = "dtc"
            "Environment" = "dev"
            "Team"        = "dtc"
        }
      ~ unique_id             = "AROAYVDIRT4CHM3IEULNT" -> (known after apply)
    }

  # module.service_roles.aws_iam_role.orbis_roles[2] must be replaced
-/+ resource "aws_iam_role" "orbis_roles" {
      ~ arn                   = "arn:aws:iam::595072229124:role/orbis/sucks" -> (known after apply)
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = [
                          - "sts:AssumeRoleWithWebIdentity",
                          - "sts:AssumeRole",
                        ] -> "sts:AssumeRoleWithWebIdentity"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::595072229124:role/elzwhere"
                        }
                        Sid       = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2020-05-19T23:52:33Z" -> (known after apply)
        force_detach_policies = false
      ~ id                    = "sucks" -> (known after apply)
        max_session_duration  = 3600
      ~ name                  = "sucks" -> "oam" # forces replacement
        path                  = "/orbis/"
        tags                  = {
            "Customer"    = "dtc"
            "Environment" = "dev"
            "Team"        = "dtc"
        }
      ~ unique_id             = "AROAYVDIRT4CHKS5UOGIH" -> (known after apply)
    }

  # module.service_roles.aws_iam_role.orbis_roles[3] will be created
+ resource "aws_iam_role" "orbis_roles" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::595072229124:role/elzwhere"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "oxm"
      + path                  = "/orbis/"
      + tags                  = {
          + "Customer"    = "dtc"
          + "Environment" = "dev"
          + "Team"        = "dtc"
        }
      + unique_id             = (known after apply)
    }

  # module.service_roles.aws_iam_role.orbis_roles[4] will be created
+ resource "aws_iam_role" "orbis_roles" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::595072229124:role/elzwhere"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ocm"
      + path                  = "/orbis/"
      + tags                  = {
          + "Customer"    = "dtc"
          + "Environment" = "dev"
          + "Team"        = "dtc"
        }
      + unique_id             = (known after apply)
    }

  # module.service_roles.aws_iam_role.orbis_roles[5] will be created
+ resource "aws_iam_role" "orbis_roles" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::595072229124:role/elzwhere"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "oem"
      + path                  = "/orbis/"
      + tags                  = {
          + "Customer"    = "dtc"
          + "Environment" = "dev"
          + "Team"        = "dtc"
        }
      + unique_id             = (known after apply)
    }

  # module.service_roles.aws_iam_role.orbis_roles[6] will be created
+ resource "aws_iam_role" "orbis_roles" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::595072229124:role/elzwhere"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "epg"
      + path                  = "/orbis/"
      + tags                  = {
          + "Customer"    = "dtc"
          + "Environment" = "dev"
          + "Team"        = "dtc"
        }
      + unique_id             = (known after apply)
    }

Plan: 7 to add, 0 to change, 3 to destroy.
```

</details>

*Workflow: `Terraform Build`, Action: `self2`*